# Introdução ao Pandas II

In [40]:
import pandas as pd

path = 'C:\\Users\\FIC\\Documents\\Pedrosp\\003 - Arquivos\\'
file = 'bank-full.xlsx'

df = pd.read_excel(path + file, sheet_name= 'Sheet 1 - bank-full')

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

In [41]:
# Media simples pd.mean com função arredondar

media = df['balance'].mean()

round(media,0)

#media de mais de uma coluna

round(df[['balance','duration']].mean(),0)

balance     1362.0
duration     258.0
dtype: float64

In [42]:
#soma dos valores de uma variavel pd.sum()

df.balance.sum()

61589682

In [43]:
df.duration.sum()

11671811

In [44]:
df[['pdays','duration','balance']].sum()

pdays        1817384
duration    11671811
balance     61589682
dtype: int64

In [45]:
#unique - mostra todos os valores unicos de uma coluna

df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [46]:
#nunique - mostra a quantidade de elementos unicos em uma colune

df.job.nunique()

12

In [47]:
## dados duplicados

## quantiodade de elementos duplicados 

df.job.duplicated().sum()

45199

In [48]:
##quantidade de elementos duplicados em uma tabela

df.duplicated().sum()

0

In [49]:
##identificar os valores duplicados

df.loc[df.duplicated()==True]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome]
Index: []